results/1client_tmpfs/cockroachdb/maxthroughput/exp6_trial_10.txt
Adding shard node URL: jdbc:postgresql://10.0.0.36:26257/ycsb?sslmode=disable
Using shards: 1, batchSize:-1, fetchSize: -1
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 1397766
[OVERALL], Throughput(ops/sec), 31.54605277278171
[TOTAL_GCS_Copy], Count, 1
[TOTAL_GC_TIME_Copy], Time(ms), 7
[TOTAL_GC_TIME_%_Copy], Time(%), 5.007991323297319E-4
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 7
[TOTAL_GC_TIME_%], Time(%), 5.007991323297319E-4
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 378.0
[CLEANUP], MinLatency(us), 378
[CLEANUP], MaxLatency(us), 378
[CLEANUP], 99thPercentileLatency(us), 378
[CLEANUP], 99.9PercentileLatency(us), 378
[UPDATE], Operations, 44094
[UPDATE], AverageLatency(us), 31675.965891050935
[UPDATE], MinLatency(us), 898
[UPDATE], MaxLatency(us), 615514111
[UPDATE], 99thPercentileLatency(us), 94207
[UPDATE], 99.9PercentileLatency(us), 2047999
[UPDATE], Return=OK, 44094