results/1client_tmpfs/cockroachdb/maxthroughput/exp6_trial_8.txt
Adding shard node URL: jdbc:postgresql://10.0.0.35:26257/ycsb?sslmode=disable
Using shards: 1, batchSize:-1, fetchSize: -1
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 927022
[OVERALL], Throughput(ops/sec), 36.38532850353066
[TOTAL_GCS_Copy], Count, 1
[TOTAL_GC_TIME_Copy], Time(ms), 8
[TOTAL_GC_TIME_%_Copy], Time(%), 8.629784406411066E-4
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 8.629784406411066E-4
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 426.0
[CLEANUP], MinLatency(us), 426
[CLEANUP], MaxLatency(us), 426
[CLEANUP], 99thPercentileLatency(us), 426
[CLEANUP], 99.9PercentileLatency(us), 426
[UPDATE], Operations, 33730
[UPDATE], AverageLatency(us), 27460.79676845538
[UPDATE], MinLatency(us), 767
[UPDATE], MaxLatency(us), 195428351
[UPDATE], 99thPercentileLatency(us), 114495
[UPDATE], 99.9PercentileLatency(us), 3674111
[UPDATE], Return=OK, 33730