results/1client_tmpfs/cockroachdb/maxthroughput/exp6_trial_9.txt
Adding shard node URL: jdbc:postgresql://10.0.0.35:26257/ycsb?sslmode=disable
Using shards: 1, batchSize:-1, fetchSize: -1
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
Still waiting for thread Thread-2 to complete. Workload status: true
[...]
[OVERALL], RunTime(ms), 1301061
[OVERALL], Throughput(ops/sec), 21.786065372799584
[TOTAL_GCS_Copy], Count, 1
[TOTAL_GC_TIME_Copy], Time(ms), 8
[TOTAL_GC_TIME_%_Copy], Time(%), 6.148827764416887E-4
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 6.148827764416887E-4
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 429.0
[CLEANUP], MinLatency(us), 429
[CLEANUP], MaxLatency(us), 429
[CLEANUP], 99thPercentileLatency(us), 429
[CLEANUP], 99.9PercentileLatency(us), 429
[UPDATE], Operations, 28345
[UPDATE], AverageLatency(us), 45875.28717586876
[UPDATE], MinLatency(us), 882
[UPDATE], MaxLatency(us), 654835711
[UPDATE], 99thPercentileLatency(us), 112639
[UPDATE], 99.9PercentileLatency(us), 3663871
[UPDATE], Return=OK, 28345